<a href="https://colab.research.google.com/github/tewei0328/backtest/blob/main/1-2_%E7%9B%B4%E6%8E%A5%E7%94%B1%E7%B6%B2%E5%9D%80%E8%AE%80github%E4%B8%AD%E4%B9%8Bcsv%E8%B3%87%E6%96%99%E6%AA%94.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.取得鐵達尼號完整資料集

In [ ]:
import pandas as pd

In [ ]:
titanic=pd.read_csv('https://raw.githubusercontent.com/tewei0328/data/master/titanic.csv')

In [ ]:
titanic.shape

(1313, 11)

In [ ]:
titanic.head()

   row.names pclass  survived  ...      ticket   boat     sex
0          1    1st         1  ...  24160 L221      2  female
1          2    1st         0  ...         NaN    NaN  female
2          3    1st         0  ...         NaN  (135)    male
3          4    1st         0  ...         NaN    NaN  female
4          5    1st         1  ...         NaN     11    male

[5 rows x 11 columns]

# 2.將資料切片成特徵X, 和答案y
並進一步切割成訓練集, 和測試集

In [ ]:
X=titanic[['pclass','age','sex']]

In [ ]:
X.head()

  pclass      age     sex
0    1st  29.0000  female
1    1st   2.0000  female
2    1st  30.0000    male
3    1st  25.0000  female
4    1st   0.9167    male

In [ ]:
y=titanic[['survived']]

In [ ]:
y.head()

   survived
0         1
1         0
2         0
3         0
4         1

# 3. 將資料進一步切割成訓練集, 和測試集

In [ ]:
from sklearn.model_selection import train_test_split